[Archetypes.ARC_IA_ChosenAD_ArtilleryGenerator XComInteractiveLevelActor]
FriendlyDisplayName="Chosen Sarcophagus"

[Archetypes.ARC_IA_ChosenAD_BulwarkACV XComInteractiveLevelActor]
FriendlyDisplayName="Chosen Sarcophagus"

[Archetypes.ARC_IA_ChosenArtilleryComputer XComInteractiveLevelActor]
FriendlyDisplayName="Distress Beacon"

[Archetypes.ARC_IA_ChosenSarcophagus XComInteractiveLevelActor]
FriendlyDisplayName="Chosen Sarcophagus"

[Archetypes.ARC_IA_ShieldBubble XComInteractiveLevelActor]
FriendlyDisplayName="Chosen Sarcophagus"

